IdeaRS.OpenModel.Connection.WeldData
Provides data of the single weld

IdeaRS.OpenModel.Connection.WeldData.Id
Id of the weld

IdeaRS.OpenModel.Connection.WeldData.Name
Name of the weld

IdeaRS.OpenModel.Connection.WeldData.Thickness
Thickness of the weld

IdeaRS.OpenModel.Connection.WeldData.Material
Name of the material